" =================================================== "
" シンタックス設定
" =================================================== "
syntax on
colorscheme molokai


" =================================================== "
" 文字コード設定
" =================================================== "
set encoding=utf-8
set fileencodings=iso-2022-jp,enc-jp,sjis,utf-8
set fileformats=unix,dos,mac


" =================================================== "
" 検索挙動設定
" =================================================== "
set noignorecase "大文字小文字を区別する
set smartcase "大文字小文字の両方が含まれている場合は区別する
set nowrapscan "ファイル末尾まで達したときにファイル先頭に戻らない


" =================================================== "
" 編集設定 
" =================================================== "
set tabstop=8 "タブの画面上での幅
set noexpandtab "タブをスペースに展開しない
set autoindent "自動的にインデントする
set backspace=indent,eol,start "バックスペースでインデントや改行を削除できるようにする
set showmatch "対括弧を表示する
set wildmenu "強化されたコマンドライン補完を使う
set cursorline "カーソル行の背景色を変える
set cursorcolumn "カーソル位置のカラムの背景色を変える


" =================================================== "
" 画面表示設定
" =================================================== "
set number "行番号を表示
set ruler "ルーラーを表示
set nolist "タブや改行を表示しない
set nowrap "折り返し表示しない
set laststatus=2 "常にステータス行を表示
set cmdheight=2 "コマンドラインの高さ
set showcmd "コマンドをステータス行に表示
set title "タイトルを表示


" =================================================== "
" ファイル設定
" =================================================== "
set confirm "保存されていないファイルがあるときは終了前に保存確認をする
set hidden "保存されていないファイルがあるときでも別のファイルを開くことができる
set autoread "外部でファイルが変更された場合は読み直す
set nobackup "Backupファイルを作成しない
set noswapfile "Swapファイルを作成しない
set noundofile "Undoファイルを作成しない
